app/controllers/settings_controller.rb

  def update
    @user = current_user
    if @user.update_attributes(params_user)
---
UPDATE `users` SET `screen_name` = '', `bio` = '', `updated_at` = '2019-03-09 12:52:39' WHERE `users`.`id` = 1